# Explore

Explore the given datase `orders.jsonl`.

In [1]:
import pandas as pd

In [4]:
df = pd.read_json("../../orders.jsonl", lines=True)

In [5]:
df.head(10)

,id,created,products,user
0,0,1542328144,"[{'id': 0, 'name': 'Product A', 'price': 160},...","{'id': 3, 'name': 'User D', 'city': 'Sydney'}"
1,1,1544115833,"[{'id': 3, 'name': 'Product D', 'price': 130},...","{'id': 0, 'name': 'User A', 'city': 'Prague'}"
2,2,1540143218,"[{'id': 6, 'name': 'Product G', 'price': 100},...","{'id': 0, 'name': 'User A', 'city': 'Prague'}"
3,3,1542051492,"[{'id': 6, 'name': 'Product G', 'price': 100},...","{'id': 2, 'name': 'User C', 'city': 'Singapore'}"
4,4,1543571130,"[{'id': 10, 'name': 'Product K', 'price': 60},...","{'id': 5, 'name': 'User F', 'city': 'Jakarta'}"
5,5,1539751593,"[{'id': 8, 'name': 'Product I', 'price': 80}, ...","{'id': 4, 'name': 'User E', 'city': 'Melbourne'}"
6,6,1542050634,"[{'id': 11, 'name': 'Product L', 'price': 50},...","{'id': 7, 'name': 'User H', 'city': 'Kuala Lum..."
7,7,1539272684,"[{'id': 5, 'name': 'Product F', 'price': 110},...","{'id': 2, 'name': 'User C', 'city': 'Singapore'}"
8,8,1537488666,"[{'id': 7, 'name': 'Product H', 'price': 90}, ...","{'id': 0, 'name': 'User A', 'city': 'Prague'}"
9,9,1538884227,"[{'id': 12, 'name': 'Product M', 'price': 40},...","{'id': 7, 'name': 'User H', 'city': 'Kuala Lum..."

In [6]:
print(f"There is {len(df)} records.")

There is 5000 records.

In [7]:
users = df["user"].apply(lambda x: (x["id"], x["name"], x["city"]))

In [8]:
print(f"There is {len(users.unique())} of unique users.")

There is 8 of unique users.

In [9]:
print(users)

0          (3, User D, Sydney)
1          (0, User A, Prague)
2          (0, User A, Prague)
3       (2, User C, Singapore)
4         (5, User F, Jakarta)
                 ...
4995    (6, User G, Hong Kong)
4996       (0, User A, Prague)
4997       (3, User D, Sydney)
4998      (5, User F, Jakarta)
4999      (5, User F, Jakarta)
Name: user, Length: 5000, dtype: object

In [10]:
products = df["products"].explode().apply(lambda x: (x["id"], x["name"], x["price"]))

In [11]:
print(f"There is {len(products.unique())} of unique products.")

There is 16 of unique products.

In [13]:
print(products)

0       (0, Product A, 160)
0        (8, Product I, 80)
1       (3, Product D, 130)
1       (2, Product C, 140)
1       (13, Product N, 30)
               ...
4999    (0, Product A, 160)
4999    (0, Product A, 160)
4999     (8, Product I, 80)
4999    (13, Product N, 30)
4999    (1, Product B, 150)
Name: products, Length: 27347, dtype: object

In [36]:
users_orders_df = df.copy()

users_orders_df["product_count"] = users_orders_df["products"].apply(lambda x: len(x))
users_orders_df["user_id"] = users_orders_df["user"].apply(lambda x: x["id"])
users_orders_df.drop(columns=["products", "user"], inplace=True)

In [37]:
users_orders_df.head(10)

   id     created  product_count  user_id
0   0  1542328144              2        3
1   1  1544115833              3        0
2   2  1540143218              2        0
3   3  1542051492              9        2
4   4  1543571130              4        5
5   5  1539751593              6        4
6   6  1542050634             10        7
7   7  1539272684              6        2
8   8  1537488666              9        0
9   9  1538884227              6        7

In [39]:
users_orders_df.groupby(['user_id'])['product_count'].sum().sort_values(ascending=False)

user_id
2    3631
4    3630
0    3567
6    3558
7    3327
5    3289
3    3199
1    3146
Name: product_count, dtype: int64

## Examples of various database queries

Find users which ordered most products

```sql
select 
    orders.user_id, sum(order_lines.quantity) 
from 
    orders 
join 
    order_lines 
on 
    order_lines.order_id = orders.id 
group by 
    orders.user_id 
order by 
    sum(order_lines.quantity) 
desc 
limit = ?;
```